---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageKey.Dispose
source: html/921feedc-74cd-77e5-7492-26c95b471b1d.htm
---
# Autodesk.Revit.DB.FailureMessageKey.Dispose Method

Releases all resources used by the FailureMessageKey

## Syntax (C#)
```csharp
public void Dispose()
```